Revit.Elements.FreeForm
A Revit FreeForm element

Revit.Elements.FreeForm.#ctor(Autodesk.Revit.DB.FreeFormElement)
Private constructor that allows wrapping of an existing FreeForm element.
ele:

Revit.Elements.FreeForm.#ctor(Autodesk.Revit.DB.Solid)
Private constructor that constructs a FreeForm from a user-provided
solid
solid:

Revit.Elements.FreeForm.InitFreeForm(Autodesk.Revit.DB.FreeFormElement)
Initialize a FreeForm element
ele:

Revit.Elements.FreeForm.InitFreeForm(Autodesk.Revit.DB.Solid)
Initialize a FreeForm element
solid:

Revit.Elements.FreeForm.InternalSetSolid(Autodesk.Revit.DB.Solid)
Attempt to set the internal solid.  If this method fails, return false.
solid:
Returns:

Revit.Elements.FreeForm.InternalSetFreeFormElement(Autodesk.Revit.DB.FreeFormElement)
Set the FreeFormElement and update it's id and unique id
ele:

Revit.Elements.FreeForm.FromExisting(Autodesk.Revit.DB.FreeFormElement,System.Boolean)
Construct the Revit element by selection.
freeFormElement:
isRevitOwned:
Returns:

Revit.Elements.FreeForm.InternalFreeFormElement
Reference to the Element

Revit.Elements.FreeForm.InternalElement
Reference to the Element